JohnnyAppleseed2000/stm32f103rb-baremetal/Src/button.c
/*
 * button.c
 *
 *  Created on: Jan 22, 2026
 *      Author: John
 */

#include "stm32f103xx.h"
#include "stm32f103xx_gpio.h"

void delay()
{
	for(uint32_t i = 0; i < 50000; i++);
}

void GPIO_Inits()
{
	GPIO_Handle_t gpiohandle;
	gpiohandle.pGPIOx = GPIOA;
	gpiohandle.GPIO_PinConfig.GPIO_PinNumber = PIN_NUM_10;
	gpiohandle.GPIO_PinConfig.GPIO_Pin_Mode_Speed = INPUT_MODE;
	gpiohandle.GPIO_PinConfig.GPIO_OPMode = IN_PUPD;
	GPIOA->ODR &= ~(1 << PIN_NUM_10);
	GPIOA->ODR |= (1 << PIN_NUM_10);
	GPIO_Init(&gpiohandle);

	GPIO_Handle_t ledhandle;
	ledhandle.pGPIOx = GPIOA;
	ledhandle.GPIO_PinConfig.GPIO_PinNumber = PIN_NUM_5;
	ledhandle.GPIO_PinConfig.GPIO_Pin_Mode_Speed = OP_10MHZ;
	ledhandle.GPIO_PinConfig.GPIO_OPMode = OP_GP_PP;
	GPIO_Init(&ledhandle);
}

int main()
{
	GPIO_Inits();

	while(1)
	{
		while (GPIO_ReadFromInputPin(GPIOA, PIN_NUM_10))
		{
			delay();
			GPIO_ToggleOutputPin(GPIOA, PIN_NUM_5);
		}
	}

	return 0;
}
